t0biasm/embedded-project/platforms/c2000/mcal/f28p65/code/inc/hw_adc.h
//###########################################################################
//
// FILE:    hw_adc.h
//
// TITLE:   Definitions for the ADC registers.
//
//###########################################################################
// 
// C2000Ware v6.00.00.00
//
// Copyright (C) 2024 Texas Instruments Incorporated - http://www.ti.com
//
// Redistribution and use in source and binary forms, with or without 
// modification, are permitted provided that the following conditions 
// are met:
// 
//   Redistributions of source code must retain the above copyright 
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the 
//   documentation and/or other materials provided with the   
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// $
//###########################################################################

#ifndef HW_ADC_H
#define HW_ADC_H

//*************************************************************************************************
//
// The following are defines for the ADC register offsets
//
//*************************************************************************************************
#define ADC_O_CTL1             0x0U    // ADC Control 1 Register
#define ADC_O_CTL2             0x1U    // ADC Control 2 Register
#define ADC_O_BURSTCTL         0x2U    // ADC Burst Control Register
#define ADC_O_INTFLG           0x3U    // ADC Interrupt Flag Register
#define ADC_O_INTFLGCLR        0x4U    // ADC Interrupt Flag Clear Register
#define ADC_O_INTOVF           0x5U    // ADC Interrupt Overflow Register
#define ADC_O_INTOVFCLR        0x6U    // ADC Interrupt Overflow Clear Register
#define ADC_O_INTSEL1N2        0x7U    // ADC Interrupt 1 and 2 Selection Register
#define ADC_O_INTSEL3N4        0x8U    // ADC Interrupt 3 and 4 Selection Register
#define ADC_O_SOCPRICTL        0x9U    // ADC SOC Priority Control Register
#define ADC_O_INTSOCSEL1       0xAU    // ADC Interrupt SOC Selection 1 Register
#define ADC_O_INTSOCSEL2       0xBU    // ADC Interrupt SOC Selection 2 Register
#define ADC_O_SOCFLG1          0xCU    // ADC SOC Flag 1 Register
#define ADC_O_SOCFRC1          0xDU    // ADC SOC Force 1 Register
#define ADC_O_SOCOVF1          0xEU    // ADC SOC Overflow 1 Register
#define ADC_O_SOCOVFCLR1       0xFU    // ADC SOC Overflow Clear 1 Register
#define ADC_O_SOC0CTL          0x10U   // ADC SOC0 Control Register
#define ADC_O_SOC1CTL          0x12U   // ADC SOC1 Control Register
#define ADC_O_SOC2CTL          0x14U   // ADC SOC2 Control Register
#define ADC_O_SOC3CTL          0x16U   // ADC SOC3 Control Register
#define ADC_O_SOC4CTL          0x18U   // ADC SOC4 Control Register
#define ADC_O_SOC5CTL          0x1AU   // ADC SOC5 Control Register
#define ADC_O_SOC6CTL          0x1CU   // ADC SOC6 Control Register
#define ADC_O_SOC7CTL          0x1EU   // ADC SOC7 Control Register
#define ADC_O_SOC8CTL          0x20U   // ADC SOC8 Control Register
#define ADC_O_SOC9CTL          0x22U   // ADC SOC9 Control Register
#define ADC_O_SOC10CTL         0x24U   // ADC SOC10 Control Register
#define ADC_O_SOC11CTL         0x26U   // ADC SOC11 Control Register
#define ADC_O_SOC12CTL         0x28U   // ADC SOC12 Control Register
#define ADC_O_SOC13CTL         0x2AU   // ADC SOC13 Control Register
#define ADC_O_SOC14CTL         0x2CU   // ADC SOC14 Control Register
#define ADC_O_SOC15CTL         0x2EU   // ADC SOC15 Control Register
#define ADC_O_EVTSTAT          0x30U   // ADC Event Status Register
#define ADC_O_EVTCLR           0x32U   // ADC Event Clear Register
#define ADC_O_EVTSEL           0x34U   // ADC Event Selection Register
#define ADC_O_EVTINTSEL        0x36U   // ADC Event Interrupt Selection Register
#define ADC_O_OSDETECT         0x38U   // ADC Open and Shorts Detect Register
#define ADC_O_COUNTER          0x39U   // ADC Counter Register
#define ADC_O_REV              0x3AU   // ADC Revision Register
#define ADC_O_OFFTRIM          0x3BU   // ADC Offset Trim Register
#define ADC_O_OFFTRIM2         0x3CU   // ADC Offset Trim Register
#define ADC_O_OFFTRIM3         0x3DU   // ADC Offset Trim Register
#define ADC_O_PPB1CONFIG       0x40U   // ADC PPB1 Config Register
#define ADC_O_PPB1STAMP        0x41U   // ADC PPB1 Sample Delay Time Stamp Register
#define ADC_O_PPB1OFFCAL       0x42U   // ADC PPB1 Offset Calibration Register
#define ADC_O_PPB1OFFREF       0x43U   // ADC PPB1 Offset Reference Register
#define ADC_O_PPB1TRIPHI       0x44U   // ADC PPB1 Trip High Register
#define ADC_O_PPB1TRIPLO       0x46U   // ADC PPB1 Trip Low/Trigger Time Stamp Register
#define ADC_O_PPB2CONFIG       0x48U   // ADC PPB2 Config Register
#define ADC_O_PPB2STAMP        0x49U   // ADC PPB2 Sample Delay Time Stamp Register
#define ADC_O_PPB2OFFCAL       0x4AU   // ADC PPB2 Offset Calibration Register
#define ADC_O_PPB2OFFREF       0x4BU   // ADC PPB2 Offset Reference Register
#define ADC_O_PPB2TRIPHI       0x4CU   // ADC PPB2 Trip High Register
#define ADC_O_PPB2TRIPLO       0x4EU   // ADC PPB2 Trip Low/Trigger Time Stamp Register
#define ADC_O_PPB3CONFIG       0x50U   // ADC PPB3 Config Register
#define ADC_O_PPB3STAMP        0x51U   // ADC PPB3 Sample Delay Time Stamp Register
#define ADC_O_PPB3OFFCAL       0x52U   // ADC PPB3 Offset Calibration Register
#define ADC_O_PPB3OFFREF       0x53U   // ADC PPB3 Offset Reference Register
#define ADC_O_PPB3TRIPHI       0x54U   // ADC PPB3 Trip High Register
#define ADC_O_PPB3TRIPLO       0x56U   // ADC PPB3 Trip Low/Trigger Time Stamp Register
#define ADC_O_PPB4CONFIG       0x58U   // ADC PPB4 Config Register
#define ADC_O_PPB4STAMP        0x59U   // ADC PPB4 Sample Delay Time Stamp Register
#define ADC_O_PPB4OFFCAL       0x5AU   // ADC PPB4 Offset Calibration Register
#define ADC_O_PPB4OFFREF       0x5BU   // ADC PPB4 Offset Reference Register
#define ADC_O_PPB4TRIPHI       0x5CU   // ADC PPB4 Trip High Register
#define ADC_O_PPB4TRIPLO       0x5EU   // ADC PPB4 Trip Low/Trigger Time Stamp Register
#define ADC_O_SAFECHECKRESEN   0x60U   // ADC Safe Check Result Enable Register
#define ADC_O_INTCYCLE         0x6FU   // ADC Early Interrupt Generation Cycle
#define ADC_O_INLTRIM1         0x70U   // ADC Linearity Trim 1 Register
#define ADC_O_INLTRIM2         0x72U   // ADC Linearity Trim 2 Register
#define ADC_O_INLTRIM3         0x74U   // ADC Linearity Trim 3 Register
#define ADC_O_INLTRIM4         0x76U   // ADC Linearity Trim 4 Register
#define ADC_O_INLTRIM5         0x78U   // ADC Linearity Trim 5 Register
#define ADC_O_INLTRIM6         0x7AU   // ADC Linearity Trim 6 Register
#define ADC_O_REV2             0x7DU   // ADC Wrapper Revision Register
#define ADC_O_REP1CTL          0x80U   // ADC Trigger Repeater 1 Control Register
#define ADC_O_REP1N            0x82U   // ADC Trigger Repeater 1 N Select Register
#define ADC_O_REP1PHASE        0x84U   // ADC Trigger Repeater 1 Phase Select Register
#define ADC_O_REP1SPREAD       0x86U   // ADC Trigger Repeater 1 Spread Select Register
#define ADC_O_REP1FRC          0x88U   // ADC Trigger Repeater 1 Software Force Register
#define ADC_O_REP2CTL          0x90U   // ADC Trigger Repeater 2 Control Register
#define ADC_O_REP2N            0x92U   // ADC Trigger Repeater 2 N Select Register
#define ADC_O_REP2PHASE        0x94U   // ADC Trigger Repeater 2 Phase Select Register
#define ADC_O_REP2SPREAD       0x96U   // ADC Trigger Repeater 2 Spread Select Register
#define ADC_O_REP2FRC          0x98U   // ADC Trigger Repeater 2 Software Force Register
#define ADC_O_PPB1LIMIT        0xA0U   // ADC PPB1Conversion Count Limit Register
#define ADC_O_PPBP1PCOUNT      0xA2U   // ADC PPB1 Partial Conversion Count Register
#define ADC_O_PPB1CONFIG2      0xA4U   // ADC PPB1 Sum Shift Register
#define ADC_O_PPB1PSUM         0xA6U   // ADC PPB1 Partial Sum Register
#define ADC_O_PPB1PMAX         0xA8U   // ADC PPB1 Partial Max Register
#define ADC_O_PPB1PMAXI        0xAAU   // ADC PPB1 Partial Max Index Register
#define ADC_O_PPB1PMIN         0xACU   // ADC PPB1 Partial MIN Register
#define ADC_O_PPB1PMINI        0xAEU   // ADC PPB1 Partial Min Index Register
#define ADC_O_PPB1TRIPLO2      0xB0U   // ADC PPB1 Extended Trip Low Register
#define ADC_O_PPB2LIMIT        0xBAU   // ADC PPB2Conversion Count Limit Register
#define ADC_O_PPBP2PCOUNT      0xBCU   // ADC PPB2 Partial Conversion Count Register
#define ADC_O_PPB2CONFIG2      0xBEU   // ADC PPB2 Sum Shift Register
#define ADC_O_PPB2PSUM         0xC0U   // ADC PPB2 Partial Sum Register
#define ADC_O_PPB2PMAX         0xC2U   // ADC PPB2 Partial Max Register
#define ADC_O_PPB2PMAXI        0xC4U   // ADC PPB2 Partial Max Index Register
#define ADC_O_PPB2PMIN         0xC6U   // ADC PPB2 Partial MIN Register
#define ADC_O_PPB2PMINI        0xC8U   // ADC PPB2 Partial Min Index Register
#define ADC_O_PPB2TRIPLO2      0xCAU   // ADC PPB2 Extended Trip Low Register
#define ADC_O_PPB3LIMIT        0xD4U   // ADC PPB3Conversion Count Limit Register
#define ADC_O_PPBP3PCOUNT      0xD6U   // ADC PPB3 Partial Conversion Count Register
#define ADC_O_PPB3CONFIG2      0xD8U   // ADC PPB3 Sum Shift Register
#define ADC_O_PPB3PSUM         0xDAU   // ADC PPB3 Partial Sum Register
#define ADC_O_PPB3PMAX         0xDCU   // ADC PPB3 Partial Max Register
#define ADC_O_PPB3PMAXI        0xDEU   // ADC PPB3 Partial Max Index Register
#define ADC_O_PPB3PMIN         0xE0U   // ADC PPB3 Partial MIN Register
#define ADC_O_PPB3PMINI        0xE2U   // ADC PPB3 Partial Min Index Register
#define ADC_O_PPB3TRIPLO2      0xE4U   // ADC PPB3 Extended Trip Low Register
#define ADC_O_PPB4LIMIT        0xEEU   // ADC PPB4Conversion Count Limit Register
#define ADC_O_PPBP4PCOUNT      0xF0U   // ADC PPB4 Partial Conversion Count Register
#define ADC_O_PPB4CONFIG2      0xF2U   // ADC PPB4 Sum Shift Register
#define ADC_O_PPB4PSUM         0xF4U   // ADC PPB4 Partial Sum Register
#define ADC_O_PPB4PMAX         0xF6U   // ADC PPB4 Partial Max Register
#define ADC_O_PPB4PMAXI        0xF8U   // ADC PPB4 Partial Max Index Register
#define ADC_O_PPB4PMIN         0xFAU   // ADC PPB4 Partial MIN Register
#define ADC_O_PPB4PMINI        0xFCU   // ADC PPB4 Partial Min Index Register
#define ADC_O_PPB4TRIPLO2      0xFEU   // ADC PPB4 Extended Trip Low Register

#define ADC_O_RESULT0      0x0U    // ADC Result 0 Register
#define ADC_O_RESULT1      0x1U    // ADC Result 1 Register
#define ADC_O_RESULT2      0x2U    // ADC Result 2 Register
#define ADC_O_RESULT3      0x3U    // ADC Result 3 Register
#define ADC_O_RESULT4      0x4U    // ADC Result 4 Register
#define ADC_O_RESULT5      0x5U    // ADC Result 5 Register
#define ADC_O_RESULT6      0x6U    // ADC Result 6 Register
#define ADC_O_RESULT7      0x7U    // ADC Result 7 Register
#define ADC_O_RESULT8      0x8U    // ADC Result 8 Register
#define ADC_O_RESULT9      0x9U    // ADC Result 9 Register
#define ADC_O_RESULT10     0xAU    // ADC Result 10 Register
#define ADC_O_RESULT11     0xBU    // ADC Result 11 Register
#define ADC_O_RESULT12     0xCU    // ADC Result 12 Register
#define ADC_O_RESULT13     0xDU    // ADC Result 13 Register
#define ADC_O_RESULT14     0xEU    // ADC Result 14 Register
#define ADC_O_RESULT15     0xFU    // ADC Result 15 Register
#define ADC_O_PPB1RESULT   0x10U   // ADC Post Processing Block 1 Result Register
#define ADC_O_PPB2RESULT   0x12U   // ADC Post Processing Block 2 Result Register
#define ADC_O_PPB3RESULT   0x14U   // ADC Post Processing Block 3 Result Register
#define ADC_O_PPB4RESULT   0x16U   // ADC Post Processing Block 4 Result Register
#define ADC_O_PPB1SUM      0x18U   // ADC PPB 1 Final Sum Result Register
#define ADC_O_PPB1COUNT    0x1AU   // ADC PPB1 Final Conversion Count Register
#define ADC_O_PPB2SUM      0x1CU   // ADC PPB 2 Final Sum Result Register
#define ADC_O_PPB2COUNT    0x1EU   // ADC PPB2 Final Conversion Count Register
#define ADC_O_PPB3SUM      0x20U   // ADC PPB 3 Final Sum Result Register
#define ADC_O_PPB3COUNT    0x22U   // ADC PPB3 Final Conversion Count Register
#define ADC_O_PPB4SUM      0x24U   // ADC PPB 4 Final Sum Result Register
#define ADC_O_PPB4COUNT    0x26U   // ADC PPB4 Final Conversion Count Register
#define ADC_O_PPB1MAX      0x28U   // ADC PPB 1 Final Max Result Register
#define ADC_O_PPB1MAXI     0x2AU   // ADC PPB 1 Final Max Index Result Register
#define ADC_O_PPB1MIN      0x2CU   // ADC PPB 1 Final Min Result Register
#define ADC_O_PPB1MINI     0x2EU   // ADC PPB 1 Final Min Index Result Register
#define ADC_O_PPB2MAX      0x30U   // ADC PPB 2 Final Max Result Register
#define ADC_O_PPB2MAXI     0x32U   // ADC PPB 2 Final Max Index Result Register
#define ADC_O_PPB2MIN      0x34U   // ADC PPB 2 Final Min Result Register
#define ADC_O_PPB2MINI     0x36U   // ADC PPB 2 Final Min Index Result Register
#define ADC_O_PPB3MAX      0x38U   // ADC PPB 3 Final Max Result Register
#define ADC_O_PPB3MAXI     0x3AU   // ADC PPB 3 Final Max Index Result Register
#define ADC_O_PPB3MIN      0x3CU   // ADC PPB 3 Final Min Result Register
#define ADC_O_PPB3MINI     0x3EU   // ADC PPB 3 Final Min Index Result Register
#define ADC_O_PPB4MAX      0x40U   // ADC PPB 4 Final Max Result Register
#define ADC_O_PPB4MAXI     0x42U   // ADC PPB 4 Final Max Index Result Register
#define ADC_O_PPB4MIN      0x44U   // ADC PPB 4 Final Min Result Register
#define ADC_O_PPB4MINI     0x46U   // ADC PPB 4 Final Min Index Result Register

