t0biasm/embedded-project/platforms/c2000/mcal/f28p65/code/inc/hw_adc.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the OOTFLG register
//
//*************************************************************************************************
#define ADC_OOTFLG_OOT1    0x1U      // Checker 1 Out-of-Tolerance Flag
#define ADC_OOTFLG_OOT2    0x2U      // Checker 2 Out-of-Tolerance Flag
#define ADC_OOTFLG_OOT3    0x4U      // Checker 3 Out-of-Tolerance Flag
#define ADC_OOTFLG_OOT4    0x8U      // Checker 4 Out-of-Tolerance Flag
#define ADC_OOTFLG_OOT5    0x10U     // Checker 5 Out-of-Tolerance Flag
#define ADC_OOTFLG_OOT6    0x20U     // Checker 6 Out-of-Tolerance Flag
#define ADC_OOTFLG_OOT7    0x40U     // Checker 7 Out-of-Tolerance Flag
#define ADC_OOTFLG_OOT8    0x80U     // Checker 8 Out-of-Tolerance Flag
#define ADC_OOTFLG_OOT9    0x100U    // Checker 9 Out-of-Tolerance Flag
#define ADC_OOTFLG_OOT10   0x200U    // Checker 10 Out-of-Tolerance Flag
#define ADC_OOTFLG_OOT11   0x400U    // Checker 11 Out-of-Tolerance Flag
#define ADC_OOTFLG_OOT12   0x800U    // Checker 12 Out-of-Tolerance Flag
#define ADC_OOTFLG_OOT13   0x1000U   // Checker 13 Out-of-Tolerance Flag
#define ADC_OOTFLG_OOT14   0x2000U   // Checker 14 Out-of-Tolerance Flag
#define ADC_OOTFLG_OOT15   0x4000U   // Checker 15 Out-of-Tolerance Flag
#define ADC_OOTFLG_OOT16   0x8000U   // Checker 16 Out-of-Tolerance Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the OOTFLGCLR register
//
//*************************************************************************************************
#define ADC_OOTFLGCLR_OOT1    0x1U      // Checker 1 OOT Flag Clear
#define ADC_OOTFLGCLR_OOT2    0x2U      // Checker 2 OOT Flag Clear
#define ADC_OOTFLGCLR_OOT3    0x4U      // Checker 3 OOT Flag Clear
#define ADC_OOTFLGCLR_OOT4    0x8U      // Checker 4 OOT Flag Clear
#define ADC_OOTFLGCLR_OOT5    0x10U     // Checker 5 OOT Flag Clear
#define ADC_OOTFLGCLR_OOT6    0x20U     // Checker 6 OOT Flag Clear
#define ADC_OOTFLGCLR_OOT7    0x40U     // Checker 7 OOT Flag Clear
#define ADC_OOTFLGCLR_OOT8    0x80U     // Checker 8 OOT Flag Clear
#define ADC_OOTFLGCLR_OOT9    0x100U    // Checker 9 OOT Flag Clear
#define ADC_OOTFLGCLR_OOT10   0x200U    // Checker 10 OOT Flag Clear
#define ADC_OOTFLGCLR_OOT11   0x400U    // Checker 11 OOT Flag Clear
#define ADC_OOTFLGCLR_OOT12   0x800U    // Checker 12 OOT Flag Clear
#define ADC_OOTFLGCLR_OOT13   0x1000U   // Checker 13 OOT Flag Clear
#define ADC_OOTFLGCLR_OOT14   0x2000U   // Checker 14 OOT Flag Clear
#define ADC_OOTFLGCLR_OOT15   0x4000U   // Checker 15 OOT Flag Clear
#define ADC_OOTFLGCLR_OOT16   0x8000U   // Checker 16 OOT Flag Clear

//*************************************************************************************************
//
// The following are defines for the bit fields in the RES1OVF register
//
//*************************************************************************************************
#define ADC_RES1OVF_RES1OVF1    0x1U      // Checker 1 Result 1 Overflow Flag
#define ADC_RES1OVF_RES1OVF2    0x2U      // Checker 2 Result 1 Overflow Flag
#define ADC_RES1OVF_RES1OVF3    0x4U      // Checker 3 Result 1 Overflow Flag
#define ADC_RES1OVF_RES1OVF4    0x8U      // Checker 4 Result 1 Overflow Flag
#define ADC_RES1OVF_RES1OVF5    0x10U     // Checker 5 Result 5 Overflow Flag
#define ADC_RES1OVF_RES1OVF6    0x20U     // Checker 6 Result 1 Overflow Flag
#define ADC_RES1OVF_RES1OVF7    0x40U     // Checker 7 Result 1 Overflow Flag
#define ADC_RES1OVF_RES1OVF8    0x80U     // Checker 8 Result 1 Overflow Flag
#define ADC_RES1OVF_RES1OVF9    0x100U    // Checker 9 Result 1 Overflow Flag
#define ADC_RES1OVF_RES1OVF10   0x200U    // Checker 10 Result 1 Overflow Flag
#define ADC_RES1OVF_RES1OVF11   0x400U    // Checker 11 Result 1 Overflow Flag
#define ADC_RES1OVF_RES1OVF12   0x800U    // Checker 12 Result 1 Overflow Flag
#define ADC_RES1OVF_RES1OVF13   0x1000U   // Checker 13 Result 5 Overflow Flag
#define ADC_RES1OVF_RES1OVF14   0x2000U   // Checker 14 Result 1 Overflow Flag
#define ADC_RES1OVF_RES1OVF15   0x4000U   // Checker 15 Result 1 Overflow Flag
#define ADC_RES1OVF_RES1OVF16   0x8000U   // Checker 16 Result 1 Overflow Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the RES1OVFCLR register
//
//*************************************************************************************************
#define ADC_RES1OVFCLR_RES1OVF1    0x1U      // Checker 1 Result 1  OVF Flag Clear
#define ADC_RES1OVFCLR_RES1OVF2    0x2U      // Checker 2 Result 1 OVF Flag Clear
#define ADC_RES1OVFCLR_RES1OVF3    0x4U      // Checker 3 Result 1 OVF Flag Clear
#define ADC_RES1OVFCLR_RES1OVF4    0x8U      // Checker 4 Result 1 OVF Flag Clear
#define ADC_RES1OVFCLR_RES1OVF5    0x10U     // Checker 5 Result 1  OVF Flag Clear
#define ADC_RES1OVFCLR_RES1OVF6    0x20U     // Checker 6 Result 1 OVF Flag Clear
#define ADC_RES1OVFCLR_RES1OVF7    0x40U     // Checker 7 Result 1 OVF Flag Clear
#define ADC_RES1OVFCLR_RES1OVF8    0x80U     // Checker 8 Result 1 OVF Flag Clear
#define ADC_RES1OVFCLR_RES1OVF9    0x100U    // Checker 9 Result 1  OVF Flag Clear
#define ADC_RES1OVFCLR_RES1OVF10   0x200U    // Checker 10 Result 1 OVF Flag Clear
#define ADC_RES1OVFCLR_RES1OVF11   0x400U    // Checker 11 Result 1 OVF Flag Clear
#define ADC_RES1OVFCLR_RES1OVF12   0x800U    // Checker 12 Result 1 OVF Flag Clear
#define ADC_RES1OVFCLR_RES1OVF13   0x1000U   // Checker 13 Result 1  OVF Flag Clear
#define ADC_RES1OVFCLR_RES1OVF14   0x2000U   // Checker 14 Result 1 OVF Flag Clear
#define ADC_RES1OVFCLR_RES1OVF15   0x4000U   // Checker 15 Result 1 OVF Flag Clear
#define ADC_RES1OVFCLR_RES1OVF16   0x8000U   // Checker 16 Result 1 OVF Flag Clear

//*************************************************************************************************
//
// The following are defines for the bit fields in the RES2OVF register
//
//*************************************************************************************************
#define ADC_RES2OVF_RES2OVF1    0x1U      // Checker 1 Result 2 Overflow Flag
#define ADC_RES2OVF_RES2OVF2    0x2U      // Checker 2 Result 2 Overflow Flag
#define ADC_RES2OVF_RES2OVF3    0x4U      // Checker 3 Result 2 Overflow Flag
#define ADC_RES2OVF_RES2OVF4    0x8U      // Checker 4 Result 2 Overflow Flag
#define ADC_RES2OVF_RES2OVF5    0x10U     // Checker 5 Result 2 Overflow Flag
#define ADC_RES2OVF_RES2OVF6    0x20U     // Checker 6 Result 2 Overflow Flag
#define ADC_RES2OVF_RES2OVF7    0x40U     // Checker 7 Result 2 Overflow Flag
#define ADC_RES2OVF_RES2OVF8    0x80U     // Checker 8 Result 2 Overflow Flag
#define ADC_RES2OVF_RES2OVF9    0x100U    // Checker 9 Result 2 Overflow Flag
#define ADC_RES2OVF_RES2OVF10   0x200U    // Checker 10 Result 2 Overflow Flag
#define ADC_RES2OVF_RES2OVF11   0x400U    // Checker 11 Result 2 Overflow Flag
#define ADC_RES2OVF_RES2OVF12   0x800U    // Checker 12 Result 2 Overflow Flag
#define ADC_RES2OVF_RES2OVF13   0x1000U   // Checker 13 Result 2 Overflow Flag
#define ADC_RES2OVF_RES2OVF14   0x2000U   // Checker 14 Result 2 Overflow Flag
#define ADC_RES2OVF_RES2OVF15   0x4000U   // Checker 15 Result 2 Overflow Flag
#define ADC_RES2OVF_RES2OVF16   0x8000U   // Checker 16 Result 2 Overflow Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the RES2OVFCLR register
//
//*************************************************************************************************
#define ADC_RES2OVFCLR_RES2OVF1    0x1U      // Checker 1 Result 2  OVF Flag Clear
#define ADC_RES2OVFCLR_RES2OVF2    0x2U      // Checker 2 Result 2 OVF Flag Clear
#define ADC_RES2OVFCLR_RES2OVF3    0x4U      // Checker 3 Result 2 OVF Flag Clear
#define ADC_RES2OVFCLR_RES2OVF4    0x8U      // Checker 4 Result 2 OVF Flag Clear
#define ADC_RES2OVFCLR_RES2OVF5    0x10U     // Checker 5 Result 2  OVF Flag Clear
#define ADC_RES2OVFCLR_RES2OVF6    0x20U     // Checker 6 Result 2 OVF Flag Clear
#define ADC_RES2OVFCLR_RES2OVF7    0x40U     // Checker 7 Result 2 OVF Flag Clear
#define ADC_RES2OVFCLR_RES2OVF8    0x80U     // Checker 8 Result 2 OVF Flag Clear
#define ADC_RES2OVFCLR_RES2OVF9    0x100U    // Checker 9 Result 2  OVF Flag Clear
#define ADC_RES2OVFCLR_RES2OVF10   0x200U    // Checker 10 Result 2 OVF Flag Clear
#define ADC_RES2OVFCLR_RES2OVF11   0x400U    // Checker 11 Result 2 OVF Flag Clear
#define ADC_RES2OVFCLR_RES2OVF12   0x800U    // Checker 12 Result 2 OVF Flag Clear
#define ADC_RES2OVFCLR_RES2OVF13   0x1000U   // Checker 13 Result 2  OVF Flag Clear
#define ADC_RES2OVFCLR_RES2OVF14   0x2000U   // Checker 14 Result 2 OVF Flag Clear
#define ADC_RES2OVFCLR_RES2OVF15   0x4000U   // Checker 15 Result 2 OVF Flag Clear
#define ADC_RES2OVFCLR_RES2OVF16   0x8000U   // Checker 16 Result 2 OVF Flag Clear

//*************************************************************************************************
//
// The following are defines for the bit fields in the CHECKINTFLG register
//
//*************************************************************************************************
#define ADC_CHECKINTFLG_CHECKINT   0x1U   // ADC Safety Checker Subsystem Interrupt Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the CHECKINTFLGCLR register
//
//*************************************************************************************************
#define ADC_CHECKINTFLGCLR_CHECKINTCLR   0x1U   // ADC Safety Checker Subsystem Interrupt Flag
                                                // Clear

//*************************************************************************************************
//
// The following are defines for the bit fields in the CHECKINTSEL1 register
//
//*************************************************************************************************
#define ADC_CHECKINTSEL1_RES1OVF1EN    0x1U      // Overflow Enable from Checker 1 Result 1
#define ADC_CHECKINTSEL1_RES1OVF2EN    0x2U      // Overflow Enable from Checker 2 Result 1
#define ADC_CHECKINTSEL1_RES1OVF3EN    0x4U      // Overflow Enable from Checker 3 Result 1
#define ADC_CHECKINTSEL1_RES1OVF4EN    0x8U      // Overflow Enable from Checker 4 Result 1
#define ADC_CHECKINTSEL1_RES1OVF5EN    0x10U     // Overflow Enable from Checker 5 Result 1
#define ADC_CHECKINTSEL1_RES1OVF6EN    0x20U     // Overflow Enable from Checker 6 Result 1
#define ADC_CHECKINTSEL1_RES1OVF7EN    0x40U     // Overflow Enable from Checker 7 Result 1
#define ADC_CHECKINTSEL1_RES1OVF8EN    0x80U     // Overflow Enable from Checker 8 Result 1
#define ADC_CHECKINTSEL1_RES1OVF9EN    0x100U    // Overflow Enable from Checker 9 Result 1
#define ADC_CHECKINTSEL1_RES1OVF10EN   0x200U    // Overflow Enable from Checker 10 Result 1
#define ADC_CHECKINTSEL1_RES1OVF11EN   0x400U    // Overflow Enable from Checker 11 Result 1
#define ADC_CHECKINTSEL1_RES1OVF12EN   0x800U    // Overflow Enable from Checker 12 Result 1
#define ADC_CHECKINTSEL1_RES1OVF13EN   0x1000U   // Overflow Enable from Checker 13 Result 1
#define ADC_CHECKINTSEL1_RES1OVF14EN   0x2000U   // Overflow Enable from Checker 14 Result 1
#define ADC_CHECKINTSEL1_RES1OVF15EN   0x4000U   // Overflow Enable from Checker 15 Result 1
#define ADC_CHECKINTSEL1_RES1OVF16EN   0x8000U   // Overflow Enable from Checker 16 Result 1

//*************************************************************************************************
//
// The following are defines for the bit fields in the CHECKINTSEL2 register
//
//*************************************************************************************************
#define ADC_CHECKINTSEL2_RES2OVF1EN    0x1U      // Overflow Enable from Checker 1 Result 2
#define ADC_CHECKINTSEL2_RES2OVF2EN    0x2U      // Overflow Enable from Checker 2 Result 2
#define ADC_CHECKINTSEL2_RES2OVF3EN    0x4U      // Overflow Enable from Checker 3 Result 2
#define ADC_CHECKINTSEL2_RES2OVF4EN    0x8U      // Overflow Enable from Checker 4 Result 2
#define ADC_CHECKINTSEL2_RES2OVF5EN    0x10U     // Overflow Enable from Checker 5 Result 2
#define ADC_CHECKINTSEL2_RES2OVF6EN    0x20U     // Overflow Enable from Checker 6 Result 2
#define ADC_CHECKINTSEL2_RES2OVF7EN    0x40U     // Overflow Enable from Checker 7 Result 2
#define ADC_CHECKINTSEL2_RES2OVF8EN    0x80U     // Overflow Enable from Checker 8 Result 2
#define ADC_CHECKINTSEL2_RES2OVF9EN    0x100U    // Overflow Enable from Checker 9 Result 2
#define ADC_CHECKINTSEL2_RES2OVF10EN   0x200U    // Overflow Enable from Checker 10 Result 2
#define ADC_CHECKINTSEL2_RES2OVF11EN   0x400U    // Overflow Enable from Checker 11 Result 2
#define ADC_CHECKINTSEL2_RES2OVF12EN   0x800U    // Overflow Enable from Checker 12 Result 2
#define ADC_CHECKINTSEL2_RES2OVF13EN   0x1000U   // Overflow Enable from Checker 13 Result 2
#define ADC_CHECKINTSEL2_RES2OVF14EN   0x2000U   // Overflow Enable from Checker 14 Result 2
#define ADC_CHECKINTSEL2_RES2OVF15EN   0x4000U   // Overflow Enable from Checker 15 Result 2
#define ADC_CHECKINTSEL2_RES2OVF16EN   0x8000U   // Overflow Enable from Checker 16 Result 2

//*************************************************************************************************
//
// The following are defines for the bit fields in the CHECKINTSEL3 register
//
//*************************************************************************************************
#define ADC_CHECKINTSEL3_OOT1EN    0x1U      // Out-of-Tolerance Enable from Checker 1
#define ADC_CHECKINTSEL3_OOT2EN    0x2U      // Out-of-Tolerance Enable from Checker 2
#define ADC_CHECKINTSEL3_OOT3EN    0x4U      // Out-of-Tolerance Enable from Checker 3
#define ADC_CHECKINTSEL3_OOT4EN    0x8U      // Out-of-Tolerance Enable from Checker 4
#define ADC_CHECKINTSEL3_OOT5EN    0x10U     // Out-of-Tolerance Enable from Checker 5
#define ADC_CHECKINTSEL3_OOT6EN    0x20U     // Out-of-Tolerance Enable from Checker 6
#define ADC_CHECKINTSEL3_OOT7EN    0x40U     // Out-of-Tolerance Enable from Checker 7
#define ADC_CHECKINTSEL3_OOT8EN    0x80U     // Out-of-Tolerance Enable from Checker 8
#define ADC_CHECKINTSEL3_OOT9EN    0x100U    // Out-of-Tolerance Enable from Checker 9
#define ADC_CHECKINTSEL3_OOT10EN   0x200U    // Out-of-Tolerance Enable from Checker 10
#define ADC_CHECKINTSEL3_OOT11EN   0x400U    // Out-of-Tolerance Enable from Checker 11
#define ADC_CHECKINTSEL3_OOT12EN   0x800U    // Out-of-Tolerance Enable from Checker 12
#define ADC_CHECKINTSEL3_OOT13EN   0x1000U   // Out-of-Tolerance Enable from Checker 13
#define ADC_CHECKINTSEL3_OOT14EN   0x2000U   // Out-of-Tolerance Enable from Checker 14
#define ADC_CHECKINTSEL3_OOT15EN   0x4000U   // Out-of-Tolerance Enable from Checker 15
#define ADC_CHECKINTSEL3_OOT16EN   0x8000U   // Out-of-Tolerance Enable from Checker 16

//*************************************************************************************************
//
// The following are defines for the bit fields in the CHECKEVT1SEL1 register
//
//*************************************************************************************************
#define ADC_CHECKEVT1SEL1_RES1OVF1EN    0x1U      // Overflow Enable from Checker 1 Result 1
#define ADC_CHECKEVT1SEL1_RES1OVF2EN    0x2U      // Overflow Enable from Checker 2 Result 1
#define ADC_CHECKEVT1SEL1_RES1OVF3EN    0x4U      // Overflow Enable from Checker 3 Result 1
#define ADC_CHECKEVT1SEL1_RES1OVF4EN    0x8U      // Overflow Enable from Checker 4 Result 1
#define ADC_CHECKEVT1SEL1_RES1OVF5EN    0x10U     // Overflow Enable from Checker 5 Result 1
#define ADC_CHECKEVT1SEL1_RES1OVF6EN    0x20U     // Overflow Enable from Checker 6 Result 1
#define ADC_CHECKEVT1SEL1_RES1OVF7EN    0x40U     // Overflow Enable from Checker 7 Result 1
#define ADC_CHECKEVT1SEL1_RES1OVF8EN    0x80U     // Overflow Enable from Checker 8 Result 1
#define ADC_CHECKEVT1SEL1_RES1OVF9EN    0x100U    // Overflow Enable from Checker 9 Result 1
#define ADC_CHECKEVT1SEL1_RES1OVF10EN   0x200U    // Overflow Enable from Checker 10 Result 1
#define ADC_CHECKEVT1SEL1_RES1OVF11EN   0x400U    // Overflow Enable from Checker 11 Result 1
#define ADC_CHECKEVT1SEL1_RES1OVF12EN   0x800U    // Overflow Enable from Checker 12 Result 1
#define ADC_CHECKEVT1SEL1_RES1OVF13EN   0x1000U   // Overflow Enable from Checker 13 Result 1
#define ADC_CHECKEVT1SEL1_RES1OVF14EN   0x2000U   // Overflow Enable from Checker 14 Result 1
#define ADC_CHECKEVT1SEL1_RES1OVF15EN   0x4000U   // Overflow Enable from Checker 15 Result 1
#define ADC_CHECKEVT1SEL1_RES1OVF16EN   0x8000U   // Overflow Enable from Checker 16 Result 1

//*************************************************************************************************
//
// The following are defines for the bit fields in the CHECKEVT1SEL2 register
//
//*************************************************************************************************
#define ADC_CHECKEVT1SEL2_RES2OVF1EN    0x1U      // Overflow Enable from Checker 1 Result 2
#define ADC_CHECKEVT1SEL2_RES2OVF2EN    0x2U      // Overflow Enable from Checker 2 Result 2
#define ADC_CHECKEVT1SEL2_RES2OVF3EN    0x4U      // Overflow Enable from Checker 3 Result 2
#define ADC_CHECKEVT1SEL2_RES2OVF4EN    0x8U      // Overflow Enable from Checker 4 Result 2
#define ADC_CHECKEVT1SEL2_RES2OVF5EN    0x10U     // Overflow Enable from Checker 5 Result 2
#define ADC_CHECKEVT1SEL2_RES2OVF6EN    0x20U     // Overflow Enable from Checker 6 Result 2
#define ADC_CHECKEVT1SEL2_RES2OVF7EN    0x40U     // Overflow Enable from Checker 7 Result 2
#define ADC_CHECKEVT1SEL2_RES2OVF8EN    0x80U     // Overflow Enable from Checker 8 Result 2
#define ADC_CHECKEVT1SEL2_RES2OVF9EN    0x100U    // Overflow Enable from Checker 9 Result 2
#define ADC_CHECKEVT1SEL2_RES2OVF10EN   0x200U    // Overflow Enable from Checker 10 Result 2
#define ADC_CHECKEVT1SEL2_RES2OVF11EN   0x400U    // Overflow Enable from Checker 11 Result 2
#define ADC_CHECKEVT1SEL2_RES2OVF12EN   0x800U    // Overflow Enable from Checker 12 Result 2
#define ADC_CHECKEVT1SEL2_RES2OVF13EN   0x1000U   // Overflow Enable from Checker 13 Result 2
#define ADC_CHECKEVT1SEL2_RES2OVF14EN   0x2000U   // Overflow Enable from Checker 14 Result 2
#define ADC_CHECKEVT1SEL2_RES2OVF15EN   0x4000U   // Overflow Enable from Checker 15 Result 2
#define ADC_CHECKEVT1SEL2_RES2OVF16EN   0x8000U   // Overflow Enable from Checker 16 Result 2

//*************************************************************************************************
//
// The following are defines for the bit fields in the CHECKEVT1SEL3 register
//
//*************************************************************************************************
#define ADC_CHECKEVT1SEL3_OOT1EN    0x1U      // Out-of-Tolerance Enable from Checker 1
#define ADC_CHECKEVT1SEL3_OOT2EN    0x2U      // Out-of-Tolerance Enable from Checker 2
#define ADC_CHECKEVT1SEL3_OOT3EN    0x4U      // Out-of-Tolerance Enable from Checker 3
#define ADC_CHECKEVT1SEL3_OOT4EN    0x8U      // Out-of-Tolerance Enable from Checker 4
#define ADC_CHECKEVT1SEL3_OOT5EN    0x10U     // Out-of-Tolerance Enable from Checker 5
#define ADC_CHECKEVT1SEL3_OOT6EN    0x20U     // Out-of-Tolerance Enable from Checker 6
#define ADC_CHECKEVT1SEL3_OOT7EN    0x40U     // Out-of-Tolerance Enable from Checker 7
#define ADC_CHECKEVT1SEL3_OOT8EN    0x80U     // Out-of-Tolerance Enable from Checker 8
#define ADC_CHECKEVT1SEL3_OOT9EN    0x100U    // Out-of-Tolerance Enable from Checker 9
#define ADC_CHECKEVT1SEL3_OOT10EN   0x200U    // Out-of-Tolerance Enable from Checker 10
#define ADC_CHECKEVT1SEL3_OOT11EN   0x400U    // Out-of-Tolerance Enable from Checker 11
#define ADC_CHECKEVT1SEL3_OOT12EN   0x800U    // Out-of-Tolerance Enable from Checker 12
#define ADC_CHECKEVT1SEL3_OOT13EN   0x1000U   // Out-of-Tolerance Enable from Checker 13
#define ADC_CHECKEVT1SEL3_OOT14EN   0x2000U   // Out-of-Tolerance Enable from Checker 14
#define ADC_CHECKEVT1SEL3_OOT15EN   0x4000U   // Out-of-Tolerance Enable from Checker 15
#define ADC_CHECKEVT1SEL3_OOT16EN   0x8000U   // Out-of-Tolerance Enable from Checker 16

//*************************************************************************************************
//
// The following are defines for the bit fields in the CHECKEVT2SEL1 register
//
//*************************************************************************************************
#define ADC_CHECKEVT2SEL1_RES1OVF1EN    0x1U      // Overflow Enable from Checker 1 Result 1
#define ADC_CHECKEVT2SEL1_RES1OVF2EN    0x2U      // Overflow Enable from Checker 2 Result 1
#define ADC_CHECKEVT2SEL1_RES1OVF3EN    0x4U      // Overflow Enable from Checker 3 Result 1
#define ADC_CHECKEVT2SEL1_RES1OVF4EN    0x8U      // Overflow Enable from Checker 4 Result 1
#define ADC_CHECKEVT2SEL1_RES1OVF5EN    0x10U     // Overflow Enable from Checker 5 Result 1
#define ADC_CHECKEVT2SEL1_RES1OVF6EN    0x20U     // Overflow Enable from Checker 6 Result 1
#define ADC_CHECKEVT2SEL1_RES1OVF7EN    0x40U     // Overflow Enable from Checker 7 Result 1
#define ADC_CHECKEVT2SEL1_RES1OVF8EN    0x80U     // Overflow Enable from Checker 8 Result 1
#define ADC_CHECKEVT2SEL1_RES1OVF9EN    0x100U    // Overflow Enable from Checker 9 Result 1
#define ADC_CHECKEVT2SEL1_RES1OVF10EN   0x200U    // Overflow Enable from Checker 10 Result 1
#define ADC_CHECKEVT2SEL1_RES1OVF11EN   0x400U    // Overflow Enable from Checker 11 Result 1
#define ADC_CHECKEVT2SEL1_RES1OVF12EN   0x800U    // Overflow Enable from Checker 12 Result 1
#define ADC_CHECKEVT2SEL1_RES1OVF13EN   0x1000U   // Overflow Enable from Checker 13 Result 1
#define ADC_CHECKEVT2SEL1_RES1OVF14EN   0x2000U   // Overflow Enable from Checker 14 Result 1
#define ADC_CHECKEVT2SEL1_RES1OVF15EN   0x4000U   // Overflow Enable from Checker 15 Result 1
#define ADC_CHECKEVT2SEL1_RES1OVF16EN   0x8000U   // Overflow Enable from Checker 16 Result 1

