t0biasm/embedded-project/platforms/c2000/mcal/f28p65/code/inc/hw_adc.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the CHECKEVT2SEL2 register
//
//*************************************************************************************************
#define ADC_CHECKEVT2SEL2_RES2OVF1EN    0x1U      // Overflow Enable from Checker 1 Result 2
#define ADC_CHECKEVT2SEL2_RES2OVF2EN    0x2U      // Overflow Enable from Checker 2 Result 2
#define ADC_CHECKEVT2SEL2_RES2OVF3EN    0x4U      // Overflow Enable from Checker 3 Result 2
#define ADC_CHECKEVT2SEL2_RES2OVF4EN    0x8U      // Overflow Enable from Checker 4 Result 2
#define ADC_CHECKEVT2SEL2_RES2OVF5EN    0x10U     // Overflow Enable from Checker 5 Result 2
#define ADC_CHECKEVT2SEL2_RES2OVF6EN    0x20U     // Overflow Enable from Checker 6 Result 2
#define ADC_CHECKEVT2SEL2_RES2OVF7EN    0x40U     // Overflow Enable from Checker 7 Result 2
#define ADC_CHECKEVT2SEL2_RES2OVF8EN    0x80U     // Overflow Enable from Checker 8 Result 2
#define ADC_CHECKEVT2SEL2_RES2OVF9EN    0x100U    // Overflow Enable from Checker 9 Result 2
#define ADC_CHECKEVT2SEL2_RES2OVF10EN   0x200U    // Overflow Enable from Checker 10 Result 2
#define ADC_CHECKEVT2SEL2_RES2OVF11EN   0x400U    // Overflow Enable from Checker 11 Result 2
#define ADC_CHECKEVT2SEL2_RES2OVF12EN   0x800U    // Overflow Enable from Checker 12 Result 2
#define ADC_CHECKEVT2SEL2_RES2OVF13EN   0x1000U   // Overflow Enable from Checker 13 Result 2
#define ADC_CHECKEVT2SEL2_RES2OVF14EN   0x2000U   // Overflow Enable from Checker 14 Result 2
#define ADC_CHECKEVT2SEL2_RES2OVF15EN   0x4000U   // Overflow Enable from Checker 15 Result 2
#define ADC_CHECKEVT2SEL2_RES2OVF16EN   0x8000U   // Overflow Enable from Checker 16 Result 2

//*************************************************************************************************
//
// The following are defines for the bit fields in the CHECKEVT2SEL3 register
//
//*************************************************************************************************
#define ADC_CHECKEVT2SEL3_OOT1EN    0x1U      // Out-of-Tolerance Enable from Checker 1
#define ADC_CHECKEVT2SEL3_OOT2EN    0x2U      // Out-of-Tolerance Enable from Checker 2
#define ADC_CHECKEVT2SEL3_OOT3EN    0x4U      // Out-of-Tolerance Enable from Checker 3
#define ADC_CHECKEVT2SEL3_OOT4EN    0x8U      // Out-of-Tolerance Enable from Checker 4
#define ADC_CHECKEVT2SEL3_OOT5EN    0x10U     // Out-of-Tolerance Enable from Checker 5
#define ADC_CHECKEVT2SEL3_OOT6EN    0x20U     // Out-of-Tolerance Enable from Checker 6
#define ADC_CHECKEVT2SEL3_OOT7EN    0x40U     // Out-of-Tolerance Enable from Checker 7
#define ADC_CHECKEVT2SEL3_OOT8EN    0x80U     // Out-of-Tolerance Enable from Checker 8
#define ADC_CHECKEVT2SEL3_OOT9EN    0x100U    // Out-of-Tolerance Enable from Checker 9
#define ADC_CHECKEVT2SEL3_OOT10EN   0x200U    // Out-of-Tolerance Enable from Checker 10
#define ADC_CHECKEVT2SEL3_OOT11EN   0x400U    // Out-of-Tolerance Enable from Checker 11
#define ADC_CHECKEVT2SEL3_OOT12EN   0x800U    // Out-of-Tolerance Enable from Checker 12
#define ADC_CHECKEVT2SEL3_OOT13EN   0x1000U   // Out-of-Tolerance Enable from Checker 13
#define ADC_CHECKEVT2SEL3_OOT14EN   0x2000U   // Out-of-Tolerance Enable from Checker 14
#define ADC_CHECKEVT2SEL3_OOT15EN   0x4000U   // Out-of-Tolerance Enable from Checker 15
#define ADC_CHECKEVT2SEL3_OOT16EN   0x8000U   // Out-of-Tolerance Enable from Checker 16

//*************************************************************************************************
//
// The following are defines for the bit fields in the CHECKEVT3SEL1 register
//
//*************************************************************************************************
#define ADC_CHECKEVT3SEL1_RES1OVF1EN    0x1U      // Overflow Enable from Checker 1 Result 1
#define ADC_CHECKEVT3SEL1_RES1OVF2EN    0x2U      // Overflow Enable from Checker 2 Result 1
#define ADC_CHECKEVT3SEL1_RES1OVF3EN    0x4U      // Overflow Enable from Checker 3 Result 1
#define ADC_CHECKEVT3SEL1_RES1OVF4EN    0x8U      // Overflow Enable from Checker 4 Result 1
#define ADC_CHECKEVT3SEL1_RES1OVF5EN    0x10U     // Overflow Enable from Checker 5 Result 1
#define ADC_CHECKEVT3SEL1_RES1OVF6EN    0x20U     // Overflow Enable from Checker 6 Result 1
#define ADC_CHECKEVT3SEL1_RES1OVF7EN    0x40U     // Overflow Enable from Checker 7 Result 1
#define ADC_CHECKEVT3SEL1_RES1OVF8EN    0x80U     // Overflow Enable from Checker 8 Result 1
#define ADC_CHECKEVT3SEL1_RES1OVF9EN    0x100U    // Overflow Enable from Checker 9 Result 1
#define ADC_CHECKEVT3SEL1_RES1OVF10EN   0x200U    // Overflow Enable from Checker 10 Result 1
#define ADC_CHECKEVT3SEL1_RES1OVF11EN   0x400U    // Overflow Enable from Checker 11 Result 1
#define ADC_CHECKEVT3SEL1_RES1OVF12EN   0x800U    // Overflow Enable from Checker 12 Result 1
#define ADC_CHECKEVT3SEL1_RES1OVF13EN   0x1000U   // Overflow Enable from Checker 13 Result 1
#define ADC_CHECKEVT3SEL1_RES1OVF14EN   0x2000U   // Overflow Enable from Checker 14 Result 1
#define ADC_CHECKEVT3SEL1_RES1OVF15EN   0x4000U   // Overflow Enable from Checker 15 Result 1
#define ADC_CHECKEVT3SEL1_RES1OVF16EN   0x8000U   // Overflow Enable from Checker 16 Result 1

//*************************************************************************************************
//
// The following are defines for the bit fields in the CHECKEVT3SEL2 register
//
//*************************************************************************************************
#define ADC_CHECKEVT3SEL2_RES2OVF1EN    0x1U      // Overflow Enable from Checker 1 Result 2
#define ADC_CHECKEVT3SEL2_RES2OVF2EN    0x2U      // Overflow Enable from Checker 2 Result 2
#define ADC_CHECKEVT3SEL2_RES2OVF3EN    0x4U      // Overflow Enable from Checker 3 Result 2
#define ADC_CHECKEVT3SEL2_RES2OVF4EN    0x8U      // Overflow Enable from Checker 4 Result 2
#define ADC_CHECKEVT3SEL2_RES2OVF5EN    0x10U     // Overflow Enable from Checker 5 Result 2
#define ADC_CHECKEVT3SEL2_RES2OVF6EN    0x20U     // Overflow Enable from Checker 6 Result 2
#define ADC_CHECKEVT3SEL2_RES2OVF7EN    0x40U     // Overflow Enable from Checker 7 Result 2
#define ADC_CHECKEVT3SEL2_RES2OVF8EN    0x80U     // Overflow Enable from Checker 8 Result 2
#define ADC_CHECKEVT3SEL2_RES2OVF9EN    0x100U    // Overflow Enable from Checker 9 Result 2
#define ADC_CHECKEVT3SEL2_RES2OVF10EN   0x200U    // Overflow Enable from Checker 10 Result 2
#define ADC_CHECKEVT3SEL2_RES2OVF11EN   0x400U    // Overflow Enable from Checker 11 Result 2
#define ADC_CHECKEVT3SEL2_RES2OVF12EN   0x800U    // Overflow Enable from Checker 12 Result 2
#define ADC_CHECKEVT3SEL2_RES2OVF13EN   0x1000U   // Overflow Enable from Checker 13 Result 2
#define ADC_CHECKEVT3SEL2_RES2OVF14EN   0x2000U   // Overflow Enable from Checker 14 Result 2
#define ADC_CHECKEVT3SEL2_RES2OVF15EN   0x4000U   // Overflow Enable from Checker 15 Result 2
#define ADC_CHECKEVT3SEL2_RES2OVF16EN   0x8000U   // Overflow Enable from Checker 16 Result 2

//*************************************************************************************************
//
// The following are defines for the bit fields in the CHECKEVT3SEL3 register
//
//*************************************************************************************************
#define ADC_CHECKEVT3SEL3_OOT1EN    0x1U      // Out-of-Tolerance Enable from Checker 1
#define ADC_CHECKEVT3SEL3_OOT2EN    0x2U      // Out-of-Tolerance Enable from Checker 2
#define ADC_CHECKEVT3SEL3_OOT3EN    0x4U      // Out-of-Tolerance Enable from Checker 3
#define ADC_CHECKEVT3SEL3_OOT4EN    0x8U      // Out-of-Tolerance Enable from Checker 4
#define ADC_CHECKEVT3SEL3_OOT5EN    0x10U     // Out-of-Tolerance Enable from Checker 5
#define ADC_CHECKEVT3SEL3_OOT6EN    0x20U     // Out-of-Tolerance Enable from Checker 6
#define ADC_CHECKEVT3SEL3_OOT7EN    0x40U     // Out-of-Tolerance Enable from Checker 7
#define ADC_CHECKEVT3SEL3_OOT8EN    0x80U     // Out-of-Tolerance Enable from Checker 8
#define ADC_CHECKEVT3SEL3_OOT9EN    0x100U    // Out-of-Tolerance Enable from Checker 9
#define ADC_CHECKEVT3SEL3_OOT10EN   0x200U    // Out-of-Tolerance Enable from Checker 10
#define ADC_CHECKEVT3SEL3_OOT11EN   0x400U    // Out-of-Tolerance Enable from Checker 11
#define ADC_CHECKEVT3SEL3_OOT12EN   0x800U    // Out-of-Tolerance Enable from Checker 12
#define ADC_CHECKEVT3SEL3_OOT13EN   0x1000U   // Out-of-Tolerance Enable from Checker 13
#define ADC_CHECKEVT3SEL3_OOT14EN   0x2000U   // Out-of-Tolerance Enable from Checker 14
#define ADC_CHECKEVT3SEL3_OOT15EN   0x4000U   // Out-of-Tolerance Enable from Checker 15
#define ADC_CHECKEVT3SEL3_OOT16EN   0x8000U   // Out-of-Tolerance Enable from Checker 16

//*************************************************************************************************
//
// The following are defines for the bit fields in the CHECKEVT4SEL1 register
//
//*************************************************************************************************
#define ADC_CHECKEVT4SEL1_RES1OVF1EN    0x1U      // Overflow Enable from Checker 1 Result 1
#define ADC_CHECKEVT4SEL1_RES1OVF2EN    0x2U      // Overflow Enable from Checker 2 Result 1
#define ADC_CHECKEVT4SEL1_RES1OVF3EN    0x4U      // Overflow Enable from Checker 3 Result 1
#define ADC_CHECKEVT4SEL1_RES1OVF4EN    0x8U      // Overflow Enable from Checker 4 Result 1
#define ADC_CHECKEVT4SEL1_RES1OVF5EN    0x10U     // Overflow Enable from Checker 5 Result 1
#define ADC_CHECKEVT4SEL1_RES1OVF6EN    0x20U     // Overflow Enable from Checker 6 Result 1
#define ADC_CHECKEVT4SEL1_RES1OVF7EN    0x40U     // Overflow Enable from Checker 7 Result 1
#define ADC_CHECKEVT4SEL1_RES1OVF8EN    0x80U     // Overflow Enable from Checker 8 Result 1
#define ADC_CHECKEVT4SEL1_RES1OVF9EN    0x100U    // Overflow Enable from Checker 9 Result 1
#define ADC_CHECKEVT4SEL1_RES1OVF10EN   0x200U    // Overflow Enable from Checker 10 Result 1
#define ADC_CHECKEVT4SEL1_RES1OVF11EN   0x400U    // Overflow Enable from Checker 11 Result 1
#define ADC_CHECKEVT4SEL1_RES1OVF12EN   0x800U    // Overflow Enable from Checker 12 Result 1
#define ADC_CHECKEVT4SEL1_RES1OVF13EN   0x1000U   // Overflow Enable from Checker 13 Result 1
#define ADC_CHECKEVT4SEL1_RES1OVF14EN   0x2000U   // Overflow Enable from Checker 14 Result 1
#define ADC_CHECKEVT4SEL1_RES1OVF15EN   0x4000U   // Overflow Enable from Checker 15 Result 1
#define ADC_CHECKEVT4SEL1_RES1OVF16EN   0x8000U   // Overflow Enable from Checker 16 Result 1

//*************************************************************************************************
//
// The following are defines for the bit fields in the CHECKEVT4SEL2 register
//
//*************************************************************************************************
#define ADC_CHECKEVT4SEL2_RES2OVF1EN    0x1U      // Overflow Enable from Checker 1 Result 2
#define ADC_CHECKEVT4SEL2_RES2OVF2EN    0x2U      // Overflow Enable from Checker 2 Result 2
#define ADC_CHECKEVT4SEL2_RES2OVF3EN    0x4U      // Overflow Enable from Checker 3 Result 2
#define ADC_CHECKEVT4SEL2_RES2OVF4EN    0x8U      // Overflow Enable from Checker 4 Result 2
#define ADC_CHECKEVT4SEL2_RES2OVF5EN    0x10U     // Overflow Enable from Checker 5 Result 2
#define ADC_CHECKEVT4SEL2_RES2OVF6EN    0x20U     // Overflow Enable from Checker 6 Result 2
#define ADC_CHECKEVT4SEL2_RES2OVF7EN    0x40U     // Overflow Enable from Checker 7 Result 2
#define ADC_CHECKEVT4SEL2_RES2OVF8EN    0x80U     // Overflow Enable from Checker 8 Result 2
#define ADC_CHECKEVT4SEL2_RES2OVF9EN    0x100U    // Overflow Enable from Checker 9 Result 2
#define ADC_CHECKEVT4SEL2_RES2OVF10EN   0x200U    // Overflow Enable from Checker 10 Result 2
#define ADC_CHECKEVT4SEL2_RES2OVF11EN   0x400U    // Overflow Enable from Checker 11 Result 2
#define ADC_CHECKEVT4SEL2_RES2OVF12EN   0x800U    // Overflow Enable from Checker 12 Result 2
#define ADC_CHECKEVT4SEL2_RES2OVF13EN   0x1000U   // Overflow Enable from Checker 13 Result 2
#define ADC_CHECKEVT4SEL2_RES2OVF14EN   0x2000U   // Overflow Enable from Checker 14 Result 2
#define ADC_CHECKEVT4SEL2_RES2OVF15EN   0x4000U   // Overflow Enable from Checker 15 Result 2
#define ADC_CHECKEVT4SEL2_RES2OVF16EN   0x8000U   // Overflow Enable from Checker 16 Result 2

//*************************************************************************************************
//
// The following are defines for the bit fields in the CHECKEVT4SEL3 register
//
//*************************************************************************************************
#define ADC_CHECKEVT4SEL3_OOT1EN    0x1U      // Out-of-Tolerance Enable from Checker 1
#define ADC_CHECKEVT4SEL3_OOT2EN    0x2U      // Out-of-Tolerance Enable from Checker 2
#define ADC_CHECKEVT4SEL3_OOT3EN    0x4U      // Out-of-Tolerance Enable from Checker 3
#define ADC_CHECKEVT4SEL3_OOT4EN    0x8U      // Out-of-Tolerance Enable from Checker 4
#define ADC_CHECKEVT4SEL3_OOT5EN    0x10U     // Out-of-Tolerance Enable from Checker 5
#define ADC_CHECKEVT4SEL3_OOT6EN    0x20U     // Out-of-Tolerance Enable from Checker 6
#define ADC_CHECKEVT4SEL3_OOT7EN    0x40U     // Out-of-Tolerance Enable from Checker 7
#define ADC_CHECKEVT4SEL3_OOT8EN    0x80U     // Out-of-Tolerance Enable from Checker 8
#define ADC_CHECKEVT4SEL3_OOT9EN    0x100U    // Out-of-Tolerance Enable from Checker 9
#define ADC_CHECKEVT4SEL3_OOT10EN   0x200U    // Out-of-Tolerance Enable from Checker 10
#define ADC_CHECKEVT4SEL3_OOT11EN   0x400U    // Out-of-Tolerance Enable from Checker 11
#define ADC_CHECKEVT4SEL3_OOT12EN   0x800U    // Out-of-Tolerance Enable from Checker 12
#define ADC_CHECKEVT4SEL3_OOT13EN   0x1000U   // Out-of-Tolerance Enable from Checker 13
#define ADC_CHECKEVT4SEL3_OOT14EN   0x2000U   // Out-of-Tolerance Enable from Checker 14
#define ADC_CHECKEVT4SEL3_OOT15EN   0x4000U   // Out-of-Tolerance Enable from Checker 15
#define ADC_CHECKEVT4SEL3_OOT16EN   0x8000U   // Out-of-Tolerance Enable from Checker 16



#endif
